EDT/УТ/src/Documents/ГрафикЭкипажей/ГрафикЭкипажей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГрафикЭкипажей</name>
  <attributes>
    <name>ДатаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикСотрудников</name>
    <type>
      <types>DocumentRef.ГрафикРаботыСотрудников</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Экипажи</name>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>CatalogRef.новаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеТранспорта</name>
      <type>
        <types>EnumRef.СостоянияАвтотранспорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Экспедитор</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
      </type>
    </attributes>
    <attributes>
      <name>РольРейса</name>
      <type>
        <types>CatalogRef.РолиТранспорта</types>
      </type>
    </attributes>
    <attributes>
      <name>СменаРейса</name>
      <type>
        <types>CatalogRef.Смены</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭкипажАктивен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвободныеСотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>РольСотрудника</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/СформированныйГрафикПоТранспорту/СформированныйГрафикПоТранспорту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СформированныйГрафикПоТранспорту</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТранспортВыйдетВРейс</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СформированныйРейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>РольРейса</name>
    <type>
      <types>CatalogRef.РолиТранспорта</types>
    </type>
  </resources>
  <resources>
    <name>СменаРейса</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикЭкипажей</name>
    <type>
      <types>DocumentRef.ГрафикЭкипажей</types>
    </type>
  </attributes>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/Рейс/Рейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Рейс</name>
  <registerRecords>InformationRegister.РейсыЗаказов</registerRecords>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТипыТранспортовВероут</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПалетты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗагрузкиДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РейсМестнойДоставки</name>
    <type>
      <types>BusinessProcessRef.новаРейсМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>axi_Загрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленноеЗакрытиеРейса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>vr_РаспределительныйЦентр</name>
    <type>
      <types>CatalogRef.РаспределительныеЦентрыVeeroute</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодикаМаршрутизации</name>
    <type>
      <types>EnumRef.МетодикаЛогистическойМаршрутизации</types>
    </type>
  </attributes>
  <attributes>
    <name>РольРейса</name>
    <type>
      <types>CatalogRef.РолиТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаРейса</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДоставок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаборов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Точки</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасположения</name>
      <type>
        <types>EnumRef.ТипыРасположенияТочки</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТочки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресТочки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Широта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>13</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>13</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяПрибытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяВремяОтправления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановоеРасстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическийПробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДвиженияПоПлану</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДвиженияФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапланированнаяДлительностьОстановки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяДлительностьОстановки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетноеВремяПрибытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетноеВремяУбытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаказа</name>
      <type>
        <types>CatalogRef.СтатусыЗаказовВероут</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗаказа</name>
      <type>
        <types>EnumRef.ВидыЗаказовВероут</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаборТовара</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказДобавленВРучную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдаленИзРейса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагруженИзВероут</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальнаяМаршрутизация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказДобавленВЗапланированныйРейс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поездки</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоездки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяДистанция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяПродолжительностьПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяНачалаПоездки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяОкончанияПоездки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаДоступностиВодителя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончанияДоступностиВодителя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Documents/ГрафикЭкипажей/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//+Степанов Задача № 3459
	Если Не УчетКонтроляВремениСервер.ПроверитьСостояниеСобытия(ПредопределенноеЗначение("Справочник.СобытияКонтроляВремени.ПМФормированиеРейсов"),,Регион) Тогда		
		Сообщить("В данный момент уже происходит формирование рейсов!");		
		Отказ = Истина;	
	Конецесли;
	//-Степанов Задача № 3459
	
	УдалитьДвиженияДокумента();
	
	//CeHbKA 15.11.2021 #3729
	Возврат;
	//CeHbKA 15.11.2021 #3729
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СформированныйГрафикПоТранспорту");
	ЭлементБлокировки.УстановитьЗначение("ДатаРейса", ДатаПланирования);
	ЭлементБлокировки.УстановитьЗначение("Регион", Регион);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Экипажи;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Транспорт", "Транспорт");
	Блокировка.Заблокировать();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокТЧ.НомерСтроки КАК НомерСтроки,
		|	ДокТЧ.Транспорт КАК Транспорт,
		|	&ДатаПланирования КАК ДатаПланирования,
		|	&Регион КАК Регион,
		|	ДокТЧ.Водитель КАК Водитель,
		|	ДокТЧ.Экспедитор КАК Экспедитор,
		|	ДокТЧ.РольРейса КАК РольРейса,
		|	ДокТЧ.СменаРейса КАК СменаРейса,
		|	ДокТЧ.ЭкипажАктивен КАК ЭкипажАктивен
		|ПОМЕСТИТЬ ВТ_ДокТЧ
		|ИЗ
		|	&ДокТЧ КАК ДокТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СформированныйГрафикПоТранспортуСрезПоследних.Транспорт КАК Транспорт,
		|	СформированныйГрафикПоТранспортуСрезПоследних.СформированныйРейс КАК СформированныйРейс
		|ПОМЕСТИТЬ ВТ_Рейсы
		|ИЗ
		|	РегистрСведений.СформированныйГрафикПоТранспорту.СрезПоследних(
		|			,
		|			Регион = &Регион
		|				И ДатаРейса = &ДатаПланирования
		|				И Транспорт В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВТ_ДокТЧ.Транспорт КАК Транспорт
		|					ИЗ
		|						ВТ_ДокТЧ КАК ВТ_ДокТЧ)) КАК СформированныйГрафикПоТранспортуСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДокТЧ.Транспорт КАК Транспорт,
		|	ВТ_ДокТЧ.ДатаПланирования КАК ДатаПланирования,
		|	ВТ_ДокТЧ.Регион КАК Регион,
		|	ВТ_ДокТЧ.Водитель КАК Водитель,
		|	ВТ_ДокТЧ.Экспедитор КАК Экспедитор,
		|	ВТ_ДокТЧ.РольРейса КАК РольРейса,
		|	ВТ_ДокТЧ.СменаРейса КАК СменаРейса,
		|	ВТ_ДокТЧ.ЭкипажАктивен КАК ЭкипажАктивен,
		|	ЕСТЬNULL(СформированныйГрафикПоТранспортуСрезПоследних.Водитель, ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)) КАК ТекущийВодитель,
		|	ЕСТЬNULL(СформированныйГрафикПоТранспортуСрезПоследних.Экспедитор, ЗНАЧЕНИЕ(Справочник.новаЭкспедиторы.ПустаяСсылка)) КАК ТекущийЭкспедитор,
		|	ЕСТЬNULL(СформированныйГрафикПоТранспортуСрезПоследних.РольРейса, ЗНАЧЕНИЕ(Справочник.РолиТранспорта.ПустаяСсылка)) КАК ТекущийРольРейса,
		|	ЕСТЬNULL(СформированныйГрафикПоТранспортуСрезПоследних.СменаРейса, ЗНАЧЕНИЕ(Справочник.Смены.ПустаяСсылка)) КАК ТекущийСменаРейса,
		|	ЕСТЬNULL(СформированныйГрафикПоТранспортуСрезПоследних.ТранспортВыйдетВРейс, ЛОЖЬ) КАК ТекущийТранспортВыйдетВРейс,
		|	ЕСТЬNULL(ВТ_Рейсы.СформированныйРейс, ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка)) КАК ТекущийСформированныйРейс
		|ИЗ
		|	ВТ_ДокТЧ КАК ВТ_ДокТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СформированныйГрафикПоТранспорту.СрезПоследних(
		|				,
		|				(ДатаРейса, Регион, Транспорт) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВТ_ДокТЧ.ДатаПланирования КАК ДатаПланирования,
		|						ВТ_ДокТЧ.Регион КАК Регион,
		|						ВТ_ДокТЧ.Транспорт КАК Транспорт
		|					ИЗ
		|						ВТ_ДокТЧ КАК ВТ_ДокТЧ)) КАК СформированныйГрафикПоТранспортуСрезПоследних
		|		ПО ВТ_ДокТЧ.ДатаПланирования = СформированныйГрафикПоТранспортуСрезПоследних.ДатаРейса
		|			И ВТ_ДокТЧ.Регион = СформированныйГрафикПоТранспортуСрезПоследних.Регион
		|			И ВТ_ДокТЧ.Транспорт = СформированныйГрафикПоТранспортуСрезПоследних.Транспорт
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Рейсы КАК ВТ_Рейсы
		|		ПО ВТ_ДокТЧ.Транспорт = ВТ_Рейсы.СформированныйРейс";
	
	Запрос.УстановитьПараметр("ДокТч", Экипажи);
	Запрос.УстановитьПараметр("ДатаПланирования", ДатаПланирования);
	Запрос.УстановитьПараметр("Регион", Регион);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Набор = РегистрыСведений.СформированныйГрафикПоТранспорту.СоздатьНаборЗаписей();
	Набор.Отбор.Регион.Установить(Регион);
	Набор.Отбор.ДатаРейса.Установить(ДатаПланирования);
	
	Набор.Прочитать();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЕстьИзменения = (ВыборкаДетальныеЗаписи.Водитель <> ВыборкаДетальныеЗаписи.ТекущийВодитель)
			ИЛИ (ВыборкаДетальныеЗаписи.Экспедитор <> ВыборкаДетальныеЗаписи.ТекущийЭкспедитор)
			ИЛИ (ВыборкаДетальныеЗаписи.РольРейса <> ВыборкаДетальныеЗаписи.ТекущийРольРейса)
			ИЛИ (ВыборкаДетальныеЗаписи.СменаРейса <> ВыборкаДетальныеЗаписи.ТекущийСменаРейса)
			ИЛИ (ВыборкаДетальныеЗаписи.ЭкипажАктивен <> ВыборкаДетальныеЗаписи.ТекущийТранспортВыйдетВРейс);		
		
		Если НЕ ЕстьИзменения Тогда
			Продолжить;	
		КонецЕсли; 	
		
		Запись = Набор.Добавить();
		Запись.Период	  = Дата;
		Запись.Транспорт  = ВыборкаДетальныеЗаписи.Транспорт;
		Запись.ДатаРейса  = ДатаПланирования;
		Запись.Регион	  = Регион;
		
		Запись.ТранспортВыйдетВРейс = ВыборкаДетальныеЗаписи.ЭкипажАктивен;
		Запись.СформированныйРейс	= ВыборкаДетальныеЗаписи.ТекущийСформированныйРейс;
		
		Запись.Водитель	  = ВыборкаДетальныеЗаписи.Водитель;
		Запись.Экспедитор = ВыборкаДетальныеЗаписи.Экспедитор;
		Запись.РольРейса  = ВыборкаДетальныеЗаписи.РольРейса;
		Запись.СменаРейса = ВыборкаДетальныеЗаписи.СменаРейса;
		
		Запись.Пользователь = Пользователь;
		Запись.ГрафикЭкипажей = Ссылка;
	КонецЦикла;
	
	Набор.Записать();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	УдалитьДвиженияДокумента();
КонецПроцедуры

Процедура УдалитьДвиженияДокумента() Экспорт

	Регистр = РегистрыСведений.СформированныйГрафикПоТранспорту;
	Выборка = Регистр.Выбрать(,,Новый Структура("ГрафикЭкипажей", Ссылка)); 
	
	Пока Выборка.Следующий() Цикл
		Выборка.ПолучитьМенеджерЗаписи().Удалить();
	КонецЦикла;	

КонецПроцедуры
